---
kind: method
id: M:Autodesk.Revit.DB.ImportIFCOptions.Dispose
source: html/187a9c65-ce60-43b2-3149-5f02c495eb15.htm
---
# Autodesk.Revit.DB.ImportIFCOptions.Dispose Method

Releases all resources used by the ImportIFCOptions

## Syntax (C#)
```csharp
public void Dispose()
```